In [32]:
import pandas as pd

In [33]:
a=[1,2,3,4,5]
df=pd.DataFrame(a)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [34]:
df.columns=['roll']

In [35]:
print(df)

   roll
0     1
1     2
2     3
3     4
4     5

In [36]:
df['marks of out']=50

In [37]:
df['Marks scored1']=pd.Series([43,34,42,50,35])

In [38]:
df

   roll  marks of out  Marks scored1
0     1            50             43
1     2            50             34
2     3            50             42
3     4            50             50
4     5            50             35

In [39]:
df['Marks scored2']=pd.Series([42,26,43,38,49])

In [40]:
df['Marks scored3']=pd.Series([40,26,43,38,47])

In [41]:
df

   roll  marks of out  Marks scored1  Marks scored2  Marks scored3
0     1            50             43             42             40
1     2            50             34             26             26
2     3            50             42             43             43
3     4            50             50             38             38
4     5            50             35             49             47

In [42]:
df['total']=df['Marks scored1']+df['Marks scored2']+df['Marks scored3']

In [46]:
df['Average']=(df['total']*100)/(3*50)
df

,roll,marks of out,Marks scored1,Marks scored2,Marks scored3,total,Average
0,1,50,43,42,40,125,83.333333
1,2,50,34,26,26,86,57.333333
2,3,50,42,43,43,128,85.333333
3,4,50,50,38,38,126,84.000000
4,5,50,35,49,47,131,87.333333

In [47]:
df.pop('Marks scored1')

0    43
1    34
2    42
3    50
4    35
Name: Marks scored1, dtype: int64

In [48]:
df

   roll  marks of out  Marks scored2  Marks scored3  total    Average
0     1            50             42             40    125  83.333333
1     2            50             26             26     86  57.333333
2     3            50             43             43    128  85.333333
3     4            50             38             38    126  84.000000
4     5            50             49             47    131  87.333333

In [ ]:
df['Marks scored1'].var()

In [49]:
import pandas as pd
classXII_result={'Name':['Radhika','Sonia','Shaurya','Radhika'],
                'Subject':['IP','CS','Maths','Phy'],
                'Marks':[98,87,99,87],
                'Grade':['A1','A2','A1','B']}
df=pd.DataFrame(classXII_result,columns=['Name','Subject','Marks','Grade'])
print(df)

      Name Subject  Marks Grade
0  Radhika      IP     98    A1
1    Sonia      CS     87    A2
2  Shaurya   Maths     99    A1
3  Radhika     Phy     87     B

In [ ]:
pv=df.pivot(index='Name',columns='Subject',values='Marks')

In [ ]:
pv

In [ ]:
pv=df.pivot(index='Name',columns='Subject',values='Marks').fillna(' ')
pv

In [ ]:
pv=df.pivot(index='Name',columns='Subject').fillna( ' ')
pv

In [ ]:
pv.Marks.IP.fillna(' ')

In [ ]:
import pandas as pd 
name_dict={'INVIGILATOR':["Rajesh","Naveen","Anil","Naveen","Rajesh"],
          'AMOUNT':[550,550,550,550,550]}
df=pd.DataFrame(name_dict)
print(df)
pd.pivot_table(df,index=['INVIGILATOR'],aggfunc="sum")

In [ ]:
import pandas as pd 
print("\n")
print("Dataframe of value\n")
monthlysale={'Salesman':['Rinku','Jay','Radhika','Arun','Jay','Karan','Akshit','Jay','Karan','Akshit','Radhika','Karan'],
                         'Sales':[1000,300,800,1000,500,60,1000,900,300,1000,900,50],
                         'Quarter':[1,1,1,2,2,2,3,3,3,4,4,4],
                         'Distinct':['Kangra','Hamirpur','Kangra','Mandi','Hamirpur','Kangra','Kangra','Hamirpur','Mandi','Hamirpur','Hamirpur','Kangra']}
df=pd.DataFrame(monthlysale)
print(df)
print("\n")
print("Use of mode() method of DataFrame")
print(df.mode())
print("\n")
print("Use of max,min,mean,median and count\n")
pd.pivot_table(df,index=['Salesman'],values=['Sales'],aggfunc=[max,min,'mean','median','count'])

In [11]:
import pandas as pd 
df=pd.read_csv("mydata.csv",skiprows=1,names=['E_id','Ename','E_age','Ecity','Esalary'])
print(df)
r=df.pivot_table(df,index=['Ename'],aggfunc=sum)
print(r)

   E_id    Ename  E_age      Ecity  Esalary
0   100   Ritesh     25     Mumbai  15000.0
1   101   Akarsh     26        Goa  16000.0
2   102   Mahima     27  Hyderabad  20000.0
3   103  Lakshay     23      Delhi  18000.0
4   104     Manu     25     Mumbai  25000.0
5   105    Nidhi     26      Delhi      NaN
6   106    Geetu     30  Bangalore  28000.0
         E_age  E_id  Esalary
Ename
Akarsh      26   101  16000.0
Geetu       30   106  28000.0
Lakshay     23   103  18000.0
Mahima      27   102  20000.0
Manu        25   104  25000.0
Nidhi       26   105      0.0
Ritesh      25   100  15000.0

In [12]:
df.sort_values("Ename",ascending=True)

   E_id    Ename  E_age      Ecity  Esalary
1   101   Akarsh     26        Goa  16000.0
6   106    Geetu     30  Bangalore  28000.0
3   103  Lakshay     23      Delhi  18000.0
2   102   Mahima     27  Hyderabad  20000.0
4   104     Manu     25     Mumbai  25000.0
5   105    Nidhi     26      Delhi      NaN
0   100   Ritesh     25     Mumbai  15000.0

In [13]:
df.sort_values("Ename",ascending=False)

   E_id    Ename  E_age      Ecity  Esalary
0   100   Ritesh     25     Mumbai  15000.0
5   105    Nidhi     26      Delhi      NaN
4   104     Manu     25     Mumbai  25000.0
2   102   Mahima     27  Hyderabad  20000.0
3   103  Lakshay     23      Delhi  18000.0
6   106    Geetu     30  Bangalore  28000.0
1   101   Akarsh     26        Goa  16000.0

In [14]:
df.sort_values("Esalary",ascending=False)

   E_id    Ename  E_age      Ecity  Esalary
6   106    Geetu     30  Bangalore  28000.0
4   104     Manu     25     Mumbai  25000.0
2   102   Mahima     27  Hyderabad  20000.0
3   103  Lakshay     23      Delhi  18000.0
1   101   Akarsh     26        Goa  16000.0
0   100   Ritesh     25     Mumbai  15000.0
5   105    Nidhi     26      Delhi      NaN

In [15]:
df.shape[0]

7

In [16]:
df.shape[1]

5

In [17]:
print("Number of rows are",df.shape[0])

Number of rows are 7